{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"LSTM","config":{"units":16,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"lstm_LSTM13","trainable":true,"batch_input_shape":[null,15,1],"dtype":"float32"}},{"class_name":"LSTM","config":{"units":16,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"lstm_LSTM14","trainable":true}},{"class_name":"LSTM","config":{"units":16,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"lstm_LSTM15","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true}}],"keras_version":"tfjs-layers 1.2.7","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.2.7","convertedBy":null,"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"lstm_LSTM13/kernel","shape":[1,64],"dtype":"float32"},{"name":"lstm_LSTM13/recurrent_kernel","shape":[16,64],"dtype":"float32"},{"name":"lstm_LSTM13/bias","shape":[64],"dtype":"float32"},{"name":"lstm_LSTM14/kernel","shape":[16,64],"dtype":"float32"},{"name":"lstm_LSTM14/recurrent_kernel","shape":[16,64],"dtype":"float32"},{"name":"lstm_LSTM14/bias","shape":[64],"dtype":"float32"},{"name":"lstm_LSTM15/kernel","shape":[16,64],"dtype":"float32"},{"name":"lstm_LSTM15/recurrent_kernel","shape":[16,64],"dtype":"float32"},{"name":"lstm_LSTM15/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[1],"dtype":"float32"}]}]}